<script setup lang="ts">
import { useHead } from '@vueuse/head'

useHead({
  title: 'Правила користування сайтом | Кулінарний куточок',
  meta: [
    {
      name: 'description',
      content: 'Детально ознайомтесь з правилами користування сайтом Кулінарний куточок.',
    },
  ],
  link: [{ rel: 'canonical', href: 'https://kulinarny-kutochok.com.ua/rules' }],
})
</script>

<template>
  <div class="flex flex-col max-w-3xl mx-auto my-12 p-6 bg-white rounded shadow">
    <h1 class="text-3xl font-bold mb-6 text-center">Правила користування сайтом</h1>
    <ol class="list-decimal list-inside space-y-3 text-gray-800">
      <li>
        <strong>Реєстрація та контент:</strong> Користувачі можуть додавати власні рецепти та фотографії страв.
        Заборонено використовувати фото, які порушують авторські права третіх осіб.
      </li>
      <li>
        <strong>Коментарі та взаємодія:</strong> Користувачі можуть коментувати рецепти інших. Заборонено ображати інших
        користувачів у коментарях. Адміністратор має право видаляти користувачів або їх рецепти у випадках порушень,
        зокрема за скаргами інших користувачів.
      </li>
      <li>
        <strong>Заборона спаму та реклами:</strong>
        Заборонено розміщувати спам, рекламні матеріали або посилання на сторонні ресурси без дозволу адміністрації.
        Порушення цього правила може призвести до видалення контенту та блокування акаунту.
      </li>
      <li>
        <strong>Відповідальність за контент користувачів:</strong>
        Увесь контент, розміщений користувачами (тексти, фотографії тощо), є їхньою особистою відповідальністю.
        Адміністрація сайту не несе відповідальності за порушення авторських прав або інші порушення, що можуть
        виникнути через публікації користувачів.
      </li>
      <li>
        <strong>Підписки та улюблене:</strong> На сторінках з рецептами користувачі можуть додавати улюблених авторів
        (щоб швидко знаходити їх рецепти) та зберігати улюблені рецепти, які відображатимуться в їхньому профілі. Також
        можна підписатися на загальні повідомлення про появу нових рецептів на сайті, налаштувавши це у своєму профілі
        або внизу сторінки.
      </li>
      <li>
        <strong>Керування профілем і контентом:</strong> Користувачі можуть редагувати та видаляти власні рецепти,
        керувати своїми підписками та улюбленими авторами, а також видаляти свій профіль разом із усіма пов’язаними
        даними. Всі дії мають відповідати правилам користування сайтом.
      </li>
      <li>
        <strong>Відповідальність адміністрації:</strong> Адміністрація не несе відповідальності за достовірність
        рецептів. Адміністрація не відповідає за збереження даних користувачів. Сервер не робить резервних копій.
      </li>
      <li>
        <strong>Доступність сайту:</strong> Сайт може бути тимчасово недоступний під час технічних робіт. Правила
        користування можуть змінюватися без попереднього повідомлення. Сайт може бути видалений без попередження у разі
        непередбачуваних обставин.
      </li>
    </ol>
  </div>
</template>

<style scoped>
h1 {
  color: var(--color-title-h1);
}
</style>
